{
    "-i,--import_network": "Importa un modelo de red en lugar de crear uno nuevo. Este debe ser una ruta de archivo de modelo válida, específicamente un archivo generado por SMLP. Si se usa esta opción, no es necesario especificar los parámetros de la capa ya que están incluidos en el modelo.",
    "-e,--export_network":  "Exporta el modelo de red después del entrenamiento. Esto debe ser una ruta de archivo válida. El modelo exportado se puede importar más tarde, eliminando la necesidad de reentrenamiento.",
    "-f,--file_input":  "Especifica el archivo de datos que se utilizará para el entrenamiento y las pruebas.",
    "-s,--input_size": "El número de neuronas de entrada",
    "-o,--output_size": "El número de neuronas de salida",
    "-d,--hidden_size": "El número de neuronas ocultas por capa oculta",
    "-c,--hiddens_count": "El recuento de capas ocultas",
    "-p,--epochs": "El número de épocas de reentrenamiento",
    "-l,--learning_rate": "La tasa de aprendizaje del entrenamiento de la red",
    "-t,--output_ends": "Indica que las columnas de salida del conjunto de datos se encuentran al final del registro.\nPor defecto, smlp buscará en las primeras columnas",
    "-r,--training_ratio": "La proporción de entrenamiento del archivo para cambiar entre datos para entrenamiento y datos para pruebas, debería ser alrededor de 0.7",
    "-R,--training_ratio_line": "El número de línea de la proporción de entrenamiento del archivo para cambiar entre datos para entrenamiento y datos para pruebas, debería estar ubicado en el 70% del archivo.",
    "-m,--mode": "Selecciona el modo de ejecución:\n  - Predictive: Este modo utiliza un archivo de entrada para predecir las salidas.\n    Si el archivo de entrada contiene columnas de salida, las salidas CSV predichas las reemplazarán sin modificar el archivo de entrada original.\n    Por favor, ten en cuenta los parámetros (input_size, output_size, output_ends). Si el archivo de entrada no contiene columnas de salida, presta mucha atención al parámetro input_size.\n    Este modo requiere una red que haya sido importada y entrenada (asegúrate de que el modelo tenga buenos resultados de prueba).\n  - TestOnly: Prueba una red importada sin entrenamiento.\n  - TrainOnly: Entrena la red sin pruebas.\n  - TrainThenTest: Entrena y luego prueba la red (predeterminado).\n  - TrainTestMonitored: Entrena y prueba en cada época mientras se monitorea el progreso de una neurona de salida. Ten en cuenta que esto es más lento y usa más memoria.",
    "-n,--predictive_mode": "Si se utiliza el modo Predictive, selecciona el modo de renderizado de salida:\n  - CSV: Esto renderizará la(s) salida(s) al final o al principio de la línea de entrada, dependiendo de tu opción output_ends (predeterminado).\n  - NumberAndRaw: Esto mostrará tanto los números de salida predichos como sus valores brutos.\n  - NumberOnly: Esto mostrará solo el número de salidas predicho.\n  - RawOnly: Esto mostrará solo los valores brutos de la(s) salida(s).",
    "-y,--output_index_to_monitor": "Indica el índice de la neurona de salida a monitorear durante un modo TrainTestMonitored. Si el índice = 0, no habrá monitoreo de progreso. El predeterminado es 1, la primera neurona de salida.",
    "-a,--hidden_activation_function": "Selecciona la función de activación de las neuronas ocultas:\n  - ELU: Exponential Linear Units, requiere un parámetro hidden_activation_alpha.\n  - LReLU: Leaky ReLU.\n  - PReLU: Parametric ReLU, requiere un parámetro hidden_activation_alpha.\n  - ReLU: Rectified Linear Unit.\n  - Sigmoid (predeterminado).\n  - Tanh: Tangente Hiperbólica",
    "-b,--output_activation_function": "Selecciona la función de activación de las neuronas de salida:\n  - ELU: Exponential Linear Units, requiere un parámetro output_activation_alpha.\n  - LReLU: Leaky ReLU.\n  - PReLU: Parametric ReLU, requiere un parámetro output_activation_alpha.\n  - ReLU: Rectified Linear Unit.\n  - Sigmoid (predeterminado).\n  - Tanh: Tangente Hiperbólica",
    "-k,--hidden_activation_alpha": "El valor del parámetro alfa para las funciones de activación ELU y PReLU en capas ocultas",
    "-q,--output_activation_alpha": "El valor del parámetro alfa para las funciones de activación ELU y PReLU en la capa de salida",
    "-x,--disable_stdin": "Deshabilitar la entrada stdin como tuberías de comando (pipes) y pruebas interactivas",
    "-v,--version": "Mostrar la versión actual",
    "-w,--verbose": "Registros detallados",

    "UnknownKey": "Clave desconocida",
    "FailedToOpenFile": "Error al abrir el archivo",
    "InvalidJsonFile": "Archivo JSON no válido",
    "JsonParsingError": "Error de análisis JSON",
    "InvalidTotalInput": "Número inválido de valores de entrada",
    "UnimplementedPredictiveMode": "Modo predictivo no implementado",
    "MissingImportFile": "Archivo faltante para importar",
    "DifferentModelVersion": "La versión de tu archivo modelo (%%vuser%%) no es la misma que la versión actual (%%vcurrent%%)",
    "LayerTypeNotRecognized": "LayerType no reconocido",
    "LayerTypeInvalidInput": "LayerType no válido para la primera capa: no es una capa de entrada",
    "LayerTypeInvalidOutput": "LayerType no válido para la última capa: no es una capa de salida"
}
