{
    "-i,--import_network": "Importe un modèle de réseau au lieu d'en créer un nouveau. Il doit s'agir d'un chemin de fichier de modèle valide, spécifiquement un fichier généré par SMLP. Si cette option est utilisée, il n'est pas nécessaire de spécifier les paramètres de la couche car ils sont inclus dans le modèle.",
    "-e,--export_network":  "Exporte le modèle de réseau après l'entraînement. Il doit s'agir d'un chemin de fichier valide. Le modèle exporté peut être importé ultérieurement, éliminant le besoin de réentraînement.",
    "-f,--file_input":  "Spécifie le fichier de données à utiliser pour l'entraînement et les tests.",
    "-s,--input_size": "Le nombre de neurones d'entrée",
    "-o,--output_size": "Le nombre de neurones de sortie",
    "-d,--hidden_size": "Le nombre de neurones cachés par couche cachée",
    "-c,--hiddens_count": "Le nombre de couches cachées",
    "-p,--epochs": "Le nombre d'époques de réentraînement",
    "-l,--learning_rate": "Le taux d'apprentissage de l'entraînement du réseau",
    "-t,--output_ends": "Indique que les colonnes de sortie de l'ensemble de données sont situées à la fin de l'enregistrement.\nPar défaut, smlp cherchera aux premières colonnes",
    "-r,--training_ratio": "Le ratio d'entraînement du fichier pour passer entre les données d'entraînement et les données de test, devrait être d'environ 0,7",
    "-R,--training_ratio_line": "Le numéro de ligne du ratio d'entraînement du fichier pour passer entre les données pour l'entraînement et les données pour les tests, devrait être situé à 70% du fichier",
    "-m,--mode": "Sélectionnez le mode d'exécution:\n  - Predictive: Ce mode utilise un fichier d'entrée pour prédire les sorties.\n    Si le fichier d'entrée contient des colonnes de sortie, les sorties CSV prédites les remplaceront sans modifier le fichier d'entrée original.\n    Veuillez faire attention aux paramètres (input_size, output_size, output_ends). Si le fichier d'entrée ne contient pas de colonnes de sortie, faites attention au paramètre input_size.\n    Ce mode nécessite un réseau qui a été importé et formé (assurez-vous que le modèle a de bons résultats de test).\n  - TestOnly: Testez un réseau importé sans formation.\n  - TrainOnly: Entraînez le réseau sans test.\n  - TrainThenTest: Entraînez puis testez le réseau (par défaut).\n  - TrainTestMonitored: Entraînez et testez à chaque époque tout en surveillant la progression d'un neurone de sortie. Soyez conscient que c'est plus lent et utilise plus de mémoire.",
    "-n,--predictive_mode": "Si vous utilisez le mode Predictive, sélectionnez le mode de rendu de sortie:\n  - CSV: Cela rendra la ou les sortie(s) à la fin ou au début de la ligne d'entrée, en fonction de votre option output_ends (par défaut).\n  - NumberAndRaw: Cela montrera à la fois les nombres de sortie(s) prédits et leurs valeurs brutes.\n  - NumberOnly: Cela ne montrera que le nombre de sorties prédites.\n  - RawOnly: Cela ne montrera que les valeurs brutes de la ou des sortie(s).",
    "-y,--output_index_to_monitor": "Indiquez l'index du neurone de sortie à surveiller pendant un mode TrainTestMonitored. Si l'index = 0, il n'y aura pas de surveillance de la progression. Par défaut, c'est 1, le premier neurone de sortie.",
    "-a,--hidden_activation_function": "Sélectionnez la fonction d'activation des neurones cachés:\n  - ELU: Exponential Linear Units, nécessite un paramètre hidden_activation_alpha.\n  - LReLU: Leaky ReLU.\n  - PReLU: Parametric ReLU, nécessite un paramètre hidden_activation_alpha.\n  - ReLU: Rectified Linear Unit.\n  - Sigmoid (par défaut).\n  - Tanh: Tangente hyperbolique",
    "-b,--output_activation_function": "Sélectionnez la fonction d'activation des neurones de sortie:\n  - ELU: Exponential Linear Units, nécessite un paramètre output_activation_alpha.\n  - LReLU: Leaky ReLU.\n  - PReLU: Parametric ReLU, nécessite un paramètre output_activation_alpha.\n  - ReLU: Rectified Linear Unit.\n  - Sigmoid (par défaut).\n  - Tanh: Tangente hyperbolique",
    "-k,--hidden_activation_alpha": "La valeur du paramètre alpha pour les fonctions d'activation ELU et PReLU sur les couches cachées",
    "-q,--output_activation_alpha": "La valeur du paramètre alpha pour les fonctions d'activation ELU et PReLU sur la couche de sortie",
    "-x,--disable_stdin": "Désactiver l'entrée stdin comme les tuyaux de commande (pipes) et les tests interactifs",
    "-v,--version": "Affiche la version actuelle",
    "-w,--verbose": "Logs verbeux",

    "DifferentModelVersion": "La version de votre fichier modèle (%%vuser%%) n'est pas la même que la version actuelle (%%vcurrent%%)",
    "FailedToOpenFile": "Échec de l'ouverture du fichier",
    "InvalidJsonFile": "Fichier JSON invalide",
    "InvalidTotalInput": "Nombre invalide de valeurs d'entrée",
    "InvalidTotalOutput": "Taille de sortie attendue invalide",
    "JsonParsingError": "Erreur d'analyse JSON",
    "LayerTypeInvalidInput": "LayerType invalide pour la première couche : pas une couche d'entrée",
    "LayerTypeInvalidOutput": "LayerType invalide pour la dernière couche : pas une couche de sortie",
    "LayerTypeNotRecognized": "LayerType non reconnu",
    "MissingImportFile": "Fichier manquant à importer",
    "UnimplementedPredictiveMode": "Mode prédictif non implémenté",
    "UnknownKey": "Clé inconnue"
}
