{
    "-i,--import_network": "Importa un modello di rete invece di crearne uno nuovo. Questo deve essere un percorso di file di modello valido, specificamente un file generato da SMLP. Se si utilizza questa opzione, non è necessario specificare i parametri del livello poiché sono inclusi nel modello.",
    "-e,--export_network":  "Esporta il modello di rete dopo l'addestramento. Questo deve essere un percorso di file valido. Il modello esportato può essere importato successivamente, eliminando la necessità di riaddestramento.",
    "-f,--file_input":  "Specifica il file di dati da utilizzare per l'addestramento e il test.",
    "-s,--input_size": "Il numero di neuroni di input",
    "-o,--output_size": "Il numero di neuroni di output",
    "-d,--hidden_size": "Il numero di neuroni nascosti per livello nascosto",
    "-c,--hiddens_count": "Il conteggio dei livelli nascosti",
    "-p,--epochs": "Il numero di epoche di riaddestramento",
    "-l,--learning_rate": "Il tasso di apprendimento dell'addestramento della rete",
    "-t,--output_ends": "Indica che le colonne di output del set di dati si trovano alla fine del record.\nPer impostazione predefinita, smlp guarderà le prime colonne",
    "-r,--training_ratio": "Il rapporto di addestramento del file per passare tra dati per l'addestramento e dati per il test, dovrebbe essere intorno a 0,7",
    "-R,--training_ratio_line": "Il numero di riga del rapporto di addestramento del file per passare tra i dati per l'addestramento e i dati per il test, dovrebbe essere posizionato al 70% del file",
    "-m,--mode": "Seleziona la modalità di esecuzione:\n  - Predictive: questa modalità utilizza un file di input per prevedere gli output.\n    Se il file di input contiene colonne di output, gli output CSV previsti li sostituiranno senza modificare il file di input originale.\n    Si prega di prestare attenzione ai parametri (input_size, output_size, output_ends). Se il file di input non contiene colonne di output, prestare molta attenzione al parametro input_size.\n    Questa modalità richiede una rete che è stata importata e addestrata (assicurarsi che il modello abbia buoni risultati di test).\n  - TestOnly: Testa una rete importata senza addestramento.\n  - TrainOnly: Addestra la rete senza test.\n  - TrainThenTest: Addestra e poi testa la rete (predefinito).\n  - TrainTestMonitored: Addestra e testa ad ogni epoca mentre monitora il progresso di un neurone di output. Siate consapevoli che questo è più lento e utilizza più memoria.",
    "-n,--predictive_mode": "Se si utilizza la modalità Predittiva, selezionare la modalità di rendering dell'output:\n  - CSV: Questo renderizzerà l'output alla fine o all'inizio della riga di input, a seconda della tua opzione output_ends (predefinito).\n  - NumberAndRaw: Questo mostrerà sia i numeri di output previsti che i loro valori grezzi.\n  - NumberOnly: Questo mostrerà solo il numero di output previsto.\n  - RawOnly: Questo mostrerà solo i valori grezzi dell'output.",
    "-y,--output_index_to_monitor": "Indica l'indice del neurone di output da monitorare durante una modalità TrainTestMonitored. Se index = 0 non ci sarà alcun monitoraggio del progresso. Il predefinito è 1, il primo output del neurone.",
    "-a,--hidden_activation_function": "Seleziona la funzione di attivazione dei neuroni nascosti:\n  - ELU: Exponential Linear Units, richiede un parametro hidden_activation_alpha.\n  - LReLU: Leaky ReLU.\n  - PReLU: Parametric ReLU, richiede un parametro hidden_activation_alpha.\n  - ReLU: Rectified Linear Unit.\n  - Sigmoid (predefinito).\n  - Tanh: Tangente Iperbolica",
    "-b,--output_activation_function": "Seleziona la funzione di attivazione dei neuroni di output:\n  - ELU: Exponential Linear Units, richiede un parametro output_activation_alpha.\n  - LReLU: Leaky ReLU.\n  - PReLU: Parametric ReLU, richiede un parametro output_activation_alpha.\n  - ReLU: Rectified Linear Unit.\n  - Sigmoid (predefinito).\n  - Tanh: Tangente Iperbolica",
    "-A,--hidden_activation_alpha": "Il valore del parametro alpha per le funzioni di attivazione ELU e PReLU sui livelli nascosti",
    "-B,--output_activation_alpha": "Il valore del parametro alpha per le funzioni di attivazione ELU e PReLU sul livello di output",
    "-x,--disable_stdin": "Disabilita l'input stdin come pipe di comando e test interattivi",
    "-v,--version": "Mostra la versione corrente",
    "-V,--verbose": "Log dettagliati",

    "CSVParsingError": "Errore di parsing CSV alla riga %%line_number%%",
    "CSVParsingErrorEmptyLine": "Errore di parsing CSV alla riga %%line_number%%: riga vuota.",
    "CSVParsingErrorColumnsBadFormat": "Errore di parsing CSV alla riga %%line_number%%: formato errato.",
    "CSVParsingErrorColumnsMin": "Errore di parsing CSV alla riga %%line_number%%: ci sono %%value%% colonne invece di un minimo di %%expected%%.",
    "CSVParsingErrorColumnsSize": "Errore di parsing CSV alla riga %%line_number%%: ci sono %%value%% colonne invece delle %%expected%% attese.",
    "DifferentModelVersion": "La versione del tuo file modello (%%vuser%%) non è la stessa della versione corrente (%%vcurrent%%)",
    "FailedToOpenFile": "Impossibile aprire il file",
    "InvalidJsonFile": "File JSON non valido",
    "InvalidTotalInput": "Numero di valori di input non valido",
    "InvalidTotalOutput": "Dimensione dell'output previsto non valida",
    "InvalidTrainingRatioTooBig": "Non ci sono dati disponibili per il test. Si prega di controllare il parametro 'training_ratio'. Il test non può procedere.",
    "InvalidTrainingRatioTooSmall": "Parametro non valido: 'training_ratio' è troppo piccolo, non ci sono dati per l'allenamento.",
    "JsonParsingError": "Errore di parsing JSON",
    "LayerTypeInvalidInput": "LayerType non valido per il primo strato: non è uno strato di input",
    "LayerTypeInvalidOutput": "LayerType non valido per l'ultimo strato: non è uno strato di output",
    "LayerTypeNotRecognized": "LayerType non riconosciuto",
    "MissingImportFile": "File da importare mancante",
    "UnimplementedActivationFunction": "Funzione di attivazione non implementata",
    "UnimplementedPredictiveMode": "Modalità predittiva non implementata",
    "UnknownKey": "Chiave sconosciuta"
}
